---
kind: property
id: P:Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId2
source: html/46592146-bce7-c113-6c50-5f973442bfc7.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId2 Property

Id of the member in the second assembly

## Syntax (C#)
```csharp
public ElementId MemberId2 { get; }
```